{
 "Business": [
  {
   "category": "Detail",
   "content": "<div><strong>Order Online Pickup/Delivery Settings</strong></div><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Delivery - It will enable delivery options for the business/restaurant. The following fields must be configured to enable delivery option.</span><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Online order to start after time for Delivery (Mins) - The online ordering process will start after the restaurant opening time + the given minutes. This time will be taken into account for all the pre-dates. If ASAP is enabled, for the current date, ASAP time for delivery will be considered or else, the specified minutes will be considered.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Online order to end before the time for Delivery(Mins) - The online ordering process will end before the restaurant closing time + the given minutes.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Order Online Time Difference for Delivery(Mins) - The time difference for each delivery slot. The customer can choose their order time from the available slots.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Minimum Delivery Order - The minimum amount for the delivery orders. This will be considered for the order subtotal.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Maximum Delivery Order - The maximum amount for the delivery order. Delivery order subtotal cannot exceed this amount. If the maximum delivery amount is 0, then the maximum amount will not be validated and the customer can order for any amount.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Maximum Allowed Delivery Distance (In KM) - The maximum delivery distance upto which the restaurant can deliver. This distance will be considered only if “Maximum Delivery Distance Decided By” in the business setting is set to “Business”.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Enable Pre-Order For Delivery? - If enabled, the customer can order for future dates. Otherwise, only ASAP orders can be placed.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Delivery Fee Type - Based on the value chosen, delivery charges for the order will be calculated. Possible options are</span><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Flat Rate - A fixed amount will be charged for each order irrespective of the travel distance &amp; order total.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Distance-Based - The delivery charge will be calculated based on the distance between the restaurant &amp; the customer location.</span></li></ul></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Delivery Fee - The fixed delivery charge for the order. This will be taken only if the delivery fee type is “Flat Rate”.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Distance Unit - The unit in which the delivery distance to be calculated. Possible options are Kilometers &amp; miles. This is only for Distance-based delivery charges.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Delivery Fee Ranges - The configuration for distance based delivery charges. For a particular distance range, the delivery charge can be configured. The minimum order value for each delivery range can also be configured.</span></li></ul></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Pickup - It will enable pickup options for this business/restaurant.</span><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Online order to start after time for Pickup(Mins) - The online ordering process will start after the restaurant opening time + the given minutes. This time will be taken into account for all the pre-dates. If ASAP is enabled for the current date, ASAP time for delivery will be considered or else, the specified minutes will be considered.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Online order to end before the time for Pickup(Mins) - The online ordering process will end before the restaurant closing time + the given minutes.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Order Online Time Difference for Pickup(Mins) - The time difference for each pickup slot. The customer can choose their order time from the available slots.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Minimum Pickup Order - The minimum amount for the pickup orders. This will be considered for the order subtotal.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Maximum Pickup Order - The maximum amount for the pickup order. Pickup order subtotal cannot exceed this amount. If the maximum pickup amount is 0, then the maximum amount will not be validated and the customer can order for any amount.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Pickup Fee - The fixed pickup charge for the order.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Enable Pre-Order For Pickup? - If enabled, the customer can order for future dates. Otherwise, only ASAP orders can be placed.</span></li></ul></li></ul><div><strong>Preparation Time</strong></div><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Preparation Time - The possible preparation time list of the order can be configured &amp; any one time can be set as default. This will be taken only for ASAP orders. If default time is set, when a new order comes in, the preparation time will be taken automatically. Otherwise, the restaurant admin needs to enter preparation time manually for each order.</span></li></ul><div><strong>Driver Settings</strong></div><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Use Drivers Of? - If the restaurant uses their own drivers for delivery purposes, then this can be set as “Self”. Or else, if the service provider is arranging drivers for delivery, then this must be set as “Service Provider”</span><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Self Drivers - For self-drivers, the notification for the available drivers will be sent at the same time after the restaurant accepts the order. The fields “Maximum Notifications To Drivers” and “Notify Drivers Within Distance (Kms)” in business settings will not be taken into consideration if self-drivers are enabled. Note: In the driver's profile, a minimum of one business/restaurant should be mapped for self-drivers.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Service Provider Drivers - For the service provider drivers, the notification will be sent to one driver after the other until any driver accepts the order. </span></li></ul></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Note: In the driver’s profile, business/restaurant should not be mapped.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Allow Drivers To Decline Order? - If enabled, the driver will get an option to decline any new orders in the delivery partner app. </span></li></ul><div><strong>Tip Settings</strong></div><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Enable Tip for Pickup - If enabled, the tip can be collected from the customer for pickup orders.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Default Tip For Pickup (%) - The minimum tip amount that a customer can choose. From the available tip options in “Business Settings”, the tip drop down in the checkout page will be populated and customers can choose any options that are greater than or equal to the specified tip percentage.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Enable Tip for Delivery - If enabled, the tip can be collected from the customer for delivery orders.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Default Tip For Delivery (%) - The minimum tip amount that a customer can choose. From the available tip options in “Business Settings”, the tip drop down in the checkout page will be populated and customers can choose any options that are greater than or equal to the specified tip percentage.</span></li></ul><div><strong>Auto-complete Settings</strong></div><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Enable Auto-Complete Orders? - If enabled, the orders will automatically move to the “Order Completed” state without any approval. </span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">The autocomplete logic as follows:</span><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">For Pickup ASAP Orders: The order will be completed if the current time is greater than the order created time + (preparation time + auto-complete time) in minutes.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">For Delivery ASAP Orders: The order will be completed if the current time is greater than the order created time + (preparation time + time required to travel from the restaurant to customer location based on Google response + autocomplete time) in minutes.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">For Pickup &amp; Delivery Preorder: The order will be completed if the current time is greater than the requested order time + (auto-complete time) in minutes.</span></li></ul></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Auto-complete time - Auto-complete time for both delivery &amp; pickup orders can be configured. If 0 is specified, the order will not be auto-completed. This time can be configured based on the order origin also i.e.Marketplace orders &amp; custom website orders.</span></li></ul><div><strong>Payment Settings</strong></div><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Enable Custom Payment Options - The payment options for custom websites can be enabled separately. If enabled, the payment options configured for this business/restaurant will be taken or else marketplace payment options will be considered.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Payment Methods - Enabling payments based on order type. We can configure payment options separately for pickup and delivery. For example, payment options are cash, stripe, etc.</span></li></ul><div><strong>Commission Settings</strong></div><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Commission Type (use percentage) - If enabled, the commission will be calculated based on the specified percentage, or else the commission will be calculated based on the specified fixed amount.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Commission Percentage - The percentage of amount from the order subtotal will be the commission amount.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Commission Amount - The commission amount to be collected for each order.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Payment Gateway Fee Paid By? - For online payment, the payment gateway charges will be calculated based on the payment gateway service. This field will determine who has to bear the payment gateway charges. Possible options are</span><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Service Provider: Payment gateway charges will be deducted from the commission amount of the service provider.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Business: Payment gateway charges will be deducted from the settlement amount of the restaurant.</span></li></ul></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Driver Charges Paid By? - Payment should be made to the driver for delivery orders. By default, the delivery charges and tip amount will be given to the driver. If any delivery charge based discount is applied, then the actual delivery charges should be shared with the driver either from the service provider commission or from the restaurant settlement amount. Set this field empty if a delivery charge based on </span><em style=\"background-color: transparent; color: rgb(0, 0, 0);\">discount</em><span style=\"background-color: transparent; color: rgb(0, 0, 0);\"> is not available. Possible options are</span><ul><li>Service Provider: The actual delivery charge for this order will be taken from the commission amount.</li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Business: The actual delivery charge for this order will be taken from the restaurant settlement amount.</span></li></ul></li></ul><div><strong>Marketplace Settings</strong></div><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Publish In Market Place? - If enabled, then this restaurant will be listed on the marketplace website.</span><span class=\"ql-cursor\">﻿</span></li></ul>",
   "doctype": "Business",
   "domain_name": "Restaurant",
   "published": 1,
   "title": "Business"
  }
 ],
 "Business Setting": [
  {
   "category": "Detail",
   "content": "<div><strong>Order Settings</strong></div><ul><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Order Type - To enable delivery &amp; pickup option for the website.</span><ul><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Pickup: To enable only pickup orders</span></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Delivery: To enable only delivery orders</span></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Pickup &amp; Delivery: To enable both pickup &amp; delivery orders.</span></li></ul></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Default Order Type - To make any order type as a default one.</span><ul><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Pickup: To enable pickup as the default order type</span></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Delivery: To enable delivery as the default order type</span></li></ul></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Allow ASAP Orders - If enabled, the default order time will be set as soon as possible &amp; no specific order time will be captured for the order.</span></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Time for ASAP Delivery Orders (In Minutes) - If preorder is enabled for delivery orders, the next available time for the current date will be current time + asap minutes.</span></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Time for ASAP Pickup Orders (In Minutes)- If pre-order is enabled for pickup orders, the next available time for the current date will be current time + asap minutes.</span></li></ul><div><strong style=\"color: rgb(0, 0, 0); background-color: transparent;\">Delivery Settings</strong></div><ul><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Maximum Delivery Distance Decided By - Choose who can decide the delivery distance for the order. Either service provider or individual business/restaurant can decide.</span><ul><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Maximum Delivery Distance - Delivery distance upto which a customer can place an order. Distance is calculated based on the customer's location &amp; business location. (Note: This option will be enabled only when maximum delivery distance is decided by service provider)</span></li></ul></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Distance Unit - The unit in which the distance is calculated. Possible options are Kilometers &amp; Miles</span></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Distance upto which restaurants to be displayed? - Distance upto which the restaurants can be shown. i.e. if specified as 25kms, a customer can see only the restaurants that are within 25kms of customers location.</span></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Enable All Business Section in List Page - If enabled, all restaurants section will be enabled in the list page.</span></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Restrict Customer Address Count - Enable to restrict the number of addresses that a customer can add based on the address type. If enabled, a customer can add 1 Home address, 1 Work address &amp; the specified number of other category addresses</span><ul><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Max address under Other category - Number address that can be added under Other address type</span></li></ul></li></ul><div><strong>Driver Settings</strong></div><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Driver Allocation Time (In Seconds) - The total seconds for the driver to accept an order.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Maximum Notifications To Drivers - The maximum number of drivers to be notified for an individual order until a driver is assigned to that particular order.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Notify Drivers Within Distance (Kms) - Allow order notifications for the drivers based on the number of kilometers specified from the restaurant. The allocation will be executed based on the priority as follows</span><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">based on the specified distance, if none of the orders is allocated for the available drivers, then the driver who is nearer to the restaurant will get notified first.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">From the available drivers within the specified distance, if any of the drivers had already delivered an order, then the order will be sent to the driver who has not delivered yet.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">If all the drivers within the specified km’s delivered order, then the nearest driver will get notified.</span></li></ul></li></ul><div><strong>Order Cancel Settings</strong></div><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Cancel Order If Business Didn't Accept Order - If enabled, the order will get canceled if the business/restaurant didn’t accept the order within the specified seconds.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Time For Business To Accept Order (In Seconds) - Time (in seconds) given for the business/restaurant to accept the order.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Cancel Order If No Drivers Assigned - If enabled, the order will get canceled if the driver didn’t accept the order within the specified time.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Cancel After Time (In Seconds) - Within the specified time, if no drivers accept the order, then the order will be canceled.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Change Status After Time ( In Seconds) - The time after which the order status will be changed to “Driver Not Assigned” if no drivers are assigned to that order. This will work only if “cancel an order if no drivers available” is disabled.</span></li></ul><div><strong>Tip Feature</strong></div><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Enable Tip Feature - Allow the system to collect tip amount from the customer while they are placing the order.</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Possible Tip Percentage - This is the possible tip percentage value that can be shown as an option for the customer to choose on the checkout page. Admin can restrict these options based on Business in the Business/Restaurant admin page.</span></li></ul>",
   "doctype": "Business Setting",
   "domain_name": null,
   "published": 1,
   "title": "Business Setting"
  }
 ],
 "Discounts": [
  {
   "category": "Detail",
   "content": "<div><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Discounts are the offers provided to the customers. Multiple discounts can be created based on products, categories, subtotal and delivery charges. </span></div><div><span style=\"color: rgb(0, 0, 0); background-color: transparent;\"><img height=\"225\" src=\"https://lh5.googleusercontent.com/DNSbY1bMJdB1ciRvvsl-wiu3sz4DcT7FqPYfcHuadAXS6GrWt6Hkbb2-bOC3HM-i44SkRAle7QI0isnyim28KJ7GH8-vnCK21ovvmlO8sbNsmHpiSM855tRgNXK6jj-ij2fqu1cG\" width=\"624\"></span></div><ul><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Name - Name of the discount used for reference purpose</span></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Discount Type - It specifies the type of discount like product discount, category discount, order total discount, and so on. Possible values are</span><ul><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Assigned to Products - Discounts given for specific products</span></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Assigned to Categories - Discounts given for specific categories</span></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Assigned to Sub Total - Discount given for order subtotal value</span></li><li><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Assigned to Delivery Charges - Discount given for delivery charges of the order.</span></li></ul></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Price or Product Discount - It specifies whether to apply a discount for the product or giving a free product</span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Discount Products - Discounted products/items can be mapped here. The items mapped in this table will get the specified discount. This is applicable only when the discount type is “Assigned to Products”.</span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Discount Categories - Discounted categories can be mapped here. The categories mapped in this table, will get the specified discount. This is applicable only when the discount type is “Assigned to Categories”.</span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Priority - Based on the priority value, a discount will be applied. Higher the number, the higher the priority. For example, if there are two discounts available for a product, then the discount with the highest priority will be applied.</span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Discount For - This is used to define whether the discount is applicable only for a marketplace or individual custom websites or for both. Possible options are “Marketplace”, “Website”. If the field is left blank, then it will apply for both marketplace &amp; website.</span></li><li><span style=\"background-color: rgb(255, 255, 255); color: rgb(0, 0, 0);\">Discount Provided By - This defines who provides the discount whether the “Service Provider” or “Restaurant”. Based on this field, the commission amount will be calculated. This is applicable only when the discount is either blank or “Marketplace”. </span></li><li><span style=\"background-color: rgb(255, 255, 255);\"> </span></li></ul><div><span style=\"color: rgb(0, 0, 0); background-color: rgb(255, 255, 255);\"><img height=\"101\" src=\"https://lh6.googleusercontent.com/47lY5oSzvuwwSv799f0Yb6hzxC6nprYZg24KHDJh29D0YoUBXsifqH3wUuGtpzVMkQvhT2tkq12qDCwddRgsjosq8PwS93BTqho8h4JWkHdN3uTqnF9WaU2pOetjnWwWh2MfzaCb\" width=\"624\"></span></div><ul><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Valid From - Start date of a discount.</span></li><li><span style=\"background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);\">Valid Till - End date of a discount.</span></li><li><span style=\"background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);\">Min Qty - Minimum number of items required to apply this discount.</span></li><li><span style=\"background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);\">Max Qty - Maximum number of items upto which discount can be applied.\\</span></li></ul><div><span style=\"background-color: rgb(255, 255, 255);\"> </span></div><div><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\"><img height=\"59\" src=\"https://lh6.googleusercontent.com/26qemjud5l2jjyN7Bk--NsYQNA6KqquUUezbg2zxlGDNtZgnZdlLb8z8KhOO0yxQDNW-Z30Q-YNoE3LXZajeqaKAPYRuBF-QvfKJ_H8EIngAqSQ9KFpJmeU_6AVAkY33E7I8Qv2T\" width=\"624\"></span></div><ul><li><span style=\"background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);\">Limitations - To limit this discount usage based on count like the number of usages or number of usages per customer. Possible options are</span><ul><li><span style=\"background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);\">Unlimited - No restriction in terms of usage</span></li><li><span style=\"background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);\">N times only - Discount can be used only for the specific number of usages</span></li><li><span style=\"background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);\">N times per user - Discount can be used by a customer for a specific number of usages</span></li></ul></li><li><span style=\"background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);\">Limitation Count - Based on this count, the discount will be limited. This is not applicable when limitations are “Unlimited”.</span></li></ul><div><br></div><div><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\"><img height=\"112\" src=\"https://lh3.googleusercontent.com/B5mB3IDrW-9_8oEOKj5bsNN30aQE8eCAbuj9HoiTRSvO-eigPXQDXFjDI3fyY-xYTo4I3mHLJdRiBeXy7QZSU7xUs1Jp6Brf04zta3frPqlS7IZ9kqxuw0b2vHVGJuxLb4VnB2Ys\" width=\"624\"></span></div><ul><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Percentage or Amount - Determines whether to apply this discount as percentage or amount. Possible options are “Discount Percentage”, “Discount Amount”.</span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Discount Percentage - Specifies the percentage of the amount that must be given a discount. The value ranges from 1 - 100.</span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Discount Amount - Specifies the amount that must be given as a discount.</span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Max Discount Amount - To restrict the maximum discount amount. For e.g., if the discount amount is 50.00 and the max discount amount is 30.00, then the max discount amount will be applied.</span></li></ul><div><br></div><div><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\"><img height=\"241\" src=\"https://lh6.googleusercontent.com/94EFtMLVFFSbqa-9Mli3DusibayZp6IGaLlLVRdmaALPocZIM_TdyRBsSWDCTzLQ--IfUjM2ETc7uhuikp7LDxxLSpdN7Ycay7Kh99JOmTVdDMa8zUpZxYf-kevWNXVYR5XFB8Gz\" width=\"624\"></span></div><ul><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Free Product Discount (Applicable only when the discount type is “Assigned to Products”)</span><ul><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Same Product - If enabled, then the product added to the cart will be given as a free product.</span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Free Product - Specify which product must be given as a free product. It is applicable when a “Same Product” is disabled.</span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Free Qty - The number of items that must be given as free products.</span></li></ul></li></ul><div><br></div><div><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\"><img height=\"60\" src=\"https://lh6.googleusercontent.com/HIc8iZJVpqGyngx2esKLda3jWI9HQuG3fHC8lwNEKVBjjA5cMDL9oEHFq0Fe06C-zKOK5CbWST9oZmu8CXncQKPv-KFqhFK1TpJamuukLTGf3tMuWEbEdH84eOKeACg_eM6miT1B\" width=\"624\"></span></div><ul><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Requires Coupon Code - Enable this to give a discount based on coupon code. Coupon code based discount can be given only for order subtotal discount.</span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Coupon Code - Code required to apply this discount.</span></li></ul><div><br></div><div><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\"><img height=\"111\" src=\"https://lh3.googleusercontent.com/Qylj7jdkkllZoIlbRjipLStb0MLopGD5wi-b2YnYONjk5yhhJEJ4Ixm4LjxgqkQ550Uz57g8IRa6BlrF-R8FY1aDXjWj2x8nq0gyrXsbR-OyEVboHGLB7pmnKbNHpuyYX7-Z5n92\" width=\"624\"></span></div><ul><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">Requirements - Requirements are a set of rules, which must be satisfied in order to apply this discount. The following are the available requirements</span><ul><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">“Spend x amount” - This rule will apply only if the customer’s subtotal is greater than or equal to the specified amount.</span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">“Specific price range” - This rule will apply only if the customer’s subtotal is within the specified range. This rule is available only if the discount type is “Assigned to Sub Total”.</span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">“Has any one product in cart” - This rule will apply only if any of the specified products is/are available in the customer’s cart. This rule is available only if the discount type is “Assigned to Sub Total”.</span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">“Has all these products in cart” - This rule will apply only if all the specified products are available in the customer’s cart. This rule is available only if the discount type “Assigned to Sub Total”.</span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">“Limit to business” - </span><span style=\"color: rgb(34, 34, 34); background-color: transparent;\">This rule will apply only if the customer has bought products from the specified business. If any product from other businesses is selected, then this discount cannot be used. </span></li><li><span style=\"color: rgb(34, 34, 34); background-color: rgb(255, 255, 255);\">“Specific Shipping Method” - </span><span style=\"color: rgb(34, 34, 34); background-color: transparent;\">This rule is to restrict the usage of discounts based on the shipping method selected by the customer during the checkout process. This rule can be applied to all discount types. If this rule is applied to products or categories then the discount will be applied to that product only after selecting the shipping method. Otherwise, the discount will not be applied.</span></li></ul></li></ul><div><br></div><div><span style=\"color: rgb(34, 34, 34); background-color: transparent;\"><img height=\"137\" src=\"https://lh5.googleusercontent.com/hocePw5EVWFn1UiTHyNsYMHYnV2Si_MDRuFc_s6LLmimL6S1hbT4C8Bk1td3DwUwpLa_vQ6gySeRZJYjdj6oxjYP0QL6KyKm8cc7PQMZO27hWrtM1EH_EA1odQSzWCta4imAJh_B\" width=\"624\"></span></div><ul><li><span style=\"color: rgb(34, 34, 34); background-color: transparent;\">Discount Usage History - This table shows the orders in which this discount is applied. If any limitations are set in discount, then based on this usage history it will be validated.</span></li></ul>",
   "doctype": "Discounts",
   "domain_name": "Restaurant",
   "published": 1,
   "title": "Discounts"
  }
 ]
}